Revit 2024 API
PanelScheduleView.CreateInstanceView Method (Document, ElementId, ElementId)
 Creates a new instance of this view (using specific template)
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static PanelScheduleView CreateInstanceView(
	Document ADoc,
	ElementId templateId,
	ElementId panelId
)
Visual Basic
Public Shared Function CreateInstanceView ( _
	ADoc As Document, _
	templateId As ElementId, _
	panelId As ElementId _
) As PanelScheduleView
Visual C++
public:
static PanelScheduleView^ CreateInstanceView(
	Document^ ADoc,
	ElementId^ templateId,
	ElementId^ panelId
)
Parameters
ADoc
Type: Autodesk.Revit.DB.Document
 The Document
templateId
Type: Autodesk.Revit.DB.ElementId
 The templateId that this function will use
panelId
Type: Autodesk.Revit.DB.ElementId
 Element id of the electrical panel element.
Return Value
 The PanelScheduleView
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PanelScheduleView Class
CreateInstanceView Overload
Autodesk.Revit.DB.Electrical Namespace